app/controllers/api/v1/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'tad@blandaernser.com' LIMIT 1
UPDATE `users` SET `auth_token` = 'AsFZ2oQvNNmEhT8Kpjem' WHERE `users`.`id` = 1
---
  def create
    user = User.find_by(email: sessions_params[:email])

    if user && user.valid_password?(sessions_params[:password])
      sign_in user, store: false
      user.generate_authentication_token!
      user.save

SELECT  `users`.* FROM `users` WHERE `users`.`auth_token` = 'uMxyzweN5H827DxGo2DH' LIMIT 1
UPDATE `users` SET `auth_token` = 'mTxBAiJuSzXufPdiqs1Y' WHERE `users`.`id` = 5
---
  def destroy
    user = User.find_by(auth_token: params[:id])
    user.generate_authentication_token!
    user.save