app/controllers/api/v1/users_controller.rb

  def show
    begin
      @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def create
    user = User.new(user_params)

    if user.save
---
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`, `auth_token`) VALUES ('magaretwisozk@marks.info', '$2a$04$1cKExAikaxvhUrZSd7rJBOwJ4kmwyt/JEoD6gJr0S70NMDR3gyxkG', '2018-11-30 16:25:00', '2018-11-30 16:25:00', '1ixgVs1z1qHxBSM3u8wz')

  def update
    user = User.find(params[:id])

    if user.update(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = NULL LIMIT 1
UPDATE `users` SET `email` = 'victorgiraldes@icloud.com', `updated_at` = '2018-11-27 12:26:19' WHERE `users`.`id` = 3

  def destroy
    user = User.find(params[:id])
    user.destroy
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 11 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 11